Repository: luxun1910/fencing_scoring_machine
Catalog: lib/l10n/app_*.arb
Languages: fr, ja

# startStopButtonText
source: Start/Stop
fr: Démarrer/Arrêter
ja: スタート/ストップ

# doubleButtonText
source: Double
fr: Coup double
ja: クードゥブル

# resetButtonText
source: Reset
fr: Réinitialiser
ja: リセット

# offerPermissionText
source: Please grant permissions for the camera and microphone from the app information.
fr: Veuillez accorder l’autorisation à la caméra et au microphone à partir des informations de l’application.
ja: アプリ情報から、カメラとマイクへの権限を付与してください。

# offerPermissionDialogTitle
source: Permission Denied
fr: Vous n’avez pas l’autorisation.
ja: 権限がありません

# videoPageTitle
source: Video player screen
fr: Lecture vidéo
ja: ビデオ再生

# videoSaveSuccessMessage
source: The video has been saved in the gallery successfully!
fr: La vidéo a été enregistrée avec succès.
ja: 動画の保存に成功しました。

# settingsTitle
source: Settings
fr: Paramètres
ja: 設定

source: enable
fr: Activer
ja: 有効にする

source: disable
fr: Désactiver
ja: 無効にする

source: right
fr: Droite
ja: 右

source: left
fr: Gauche
ja: 左

# videoEnableOptionText
source: Video enable
fr: Fonction de prise de vidéo
ja: ビデオ撮影機能

# videoAutosaveOptionText
source: Video autosave
fr: Fonction d’enregistrement automatique de la vidéo
ja: ビデオ自動保存機能

# videoAutosaveOptionSubText
source: The videos will be saved in the gallery.
fr: La vidéo sera enregistrée dans le dossier de la galerie.
ja: ビデオはギャラリーフォルダに保存されます。

# videoPreviewSizeOptionText
source: Video preview size
fr: Taille de l’écran de prévisualisation vidéo
ja: ビデオプレビュー画面サイズ

# videoPositionOptionText
source: Position of the video preview when the screen is horizontal
fr: Position de l’écran de prévisualisation vidéo lorsque le smartphone est tenu horizontalement
ja: スマホを横持ちにした時のビデオプレビュー画面の位置

# doubleButtonOptionText
source: Double-touch button
fr: Bouton Coup double
ja: クードゥブルボタン

source: Privacy Policy
fr: Politique de confidentialité
ja: プライバシーポリシー
